Repository: hafdon/translation-an-corpan
Catalog: omegat/project_save.tmx
Source language: ga
Languages: en_us

source: Ach bhíodh eagla mhór ar phobal an Mhanataya nuair a d'fheicfidís cleite pearóide, mar ba chomhartha é go raibh dainséar mór ann.
en_us: But the Manataya public was very scared when they saw parrot feathers, as it was a sign that there was much danger.

source: Ach is ar éigean a bheadh an Príomhoide ag cur fáilte roimh a leithéid agus an scoil tar éis carn airgid a chaitheamh ar leabhair nua staire don leabharlann.
en_us: But the Principal would hardly welcome the like while the school was after spending a pile of money on new history books for the library.

source: Ach ní raibh amhras ar bith air faoin rud a chonaic sé lena shúile féin: beocht ag teacht i gcorpán.
en_us: But he didn't have any doubt at all about what he saw with his own eyes: a corpse coming to life.

source: Ach ní raibh sé in ann poll nó scoilt a fheiceáil.
en_us: But he was not able to see a hole or a fissure.

source: Ach ní raibh sé in ann.
en_us: But he wasn't able.

source: Ach tá mé cinnte gur féidir le Tomás níos mó a insint dúinn faoi.
en_us: But I'm sure that Tomas can tell us more about it.

source: Ag an nóiméad sin thosaigh an fhuil ag bailiú thart ar a chosa nochta agus, gan mhoill, bhí sé ina sheasamh i lochán fola.
en_us: At that minute the blood started to gather around his bare feet and, without delay, he stood in a pool of blood.

source: Ag breathnú ar na rudaí iontacha seo atá mé.
en_us: I'm looking at these wonderful things.

source: Agus Aodh?
en_us: And Aodh?

source: Agus a chroí ag bualadh go pianmhar ina chliabhrach, chas Pól ar ais go dtí lár na pluaise nua.
en_us: With his heart beating painfully in his chest, Paul turned back to the center of the new cave.

source: Agus an screadach sin … iuch!
en_us: And that screaming ... yuck!

source: Agus ansin – fuaim uisce ag rith, i bhfad, i bhfad ar shiúl.
en_us: And then - a sound of running water, far, far away.

source: Agus boladh aisteach éigin, rud éigin géar ag dó.
en_us: And some weird smell, something sharp burning.

source: Agus fuaim uisce ag rith arís.
en_us: And a sound of running water again.

source: Agus na pluaiseanna uafásacha sin, agus Xatlacan ar an gcathaoir a bhí déanta as cloigne cnámharlach agus é ag athrú ina phearóid-duine gránna.
en_us: And those awful caves, and Xatlacan on the chair that was made from skulls while he changed into an ugly parrot-man.

source: Agus níor chabhraigh sé leis gur san áit seo a dhúisigh sé, agus é sin gan choinne.
en_us: And it didn't help that it was in this place that he awoke, and unexpectedly at that.

source: Agus sin í an áit inar fhan sé go dtí gur aimsigh Daithí Fitzwalter é.
en_us: And that is the place in which he waited until Daithí Fitzwalter found him.

source: Agus é ar tí scread a ligean, chuala Pól an fhuaim eile: tic tic tic.
en_us: On the point of letting out a scream, Paul heard the other sound: tic tic tic.

source: An bhfuil tú ag iarraidh rud ar bith — irisí, do Ghameboy?
en_us: Do you want anything — magazines, your Gameboy?

source: An dtuigeann sibh é sin?
en_us: Do you all understand that?

source: An fhuaim chrua chéanna sin ach í níos airde anois.
en_us: That same hard sound but it was higher now.

source: An phluais
en_us: The cave

source: An sarcófagas
en_us: The sarcophagus

source: An taispeántas
en_us: The exhibit

source: Anois, má tá ceist ag duine ar bith agaibh bailígí timpeall orm anseo.
en_us: Now, if anyone has a question, gather around me here.

source: Ansin, agus gana fhios aige igceart cén fáth, thosaigh sé ag siúl go faiteach idtreo an fhoirgnimh.
en_us: Then and without the knowledge at him correct what reason, he started walking towards the building.

source: Ansin, chuala sé fuaim an uisce ag gluaiseacht arís.
en_us: Then, he heard the sound of water moving again.

source: Ansin, go tobann, mhothaigh sé rud éigin ag gluaiseacht ina threo, taobh thiar de.
en_us: Then, suddenly, he felt something moving in his direction, behind him.

source: Ansin, go tobann, stad an fhuaim gharbh taobh thiar de, agus, sa chiúnas aisteach, chuala sé fuaim eile: tic tic tic.
en_us: Then, suddenly, the harsh noise stopped behind him, and, in the strange calm, he heard another sound: tic tic tic.

source: Ansin, thug sé cluas do Thomás arís.
en_us: Then, he gave an ear to Tomas again.

source: Ansin, tháinig tromluí air.
en_us: Then, he had a nightmare.

source: Ar chuala tú mé?
en_us: Can you hear me?

source: Arís agus arís eile, rinne Pól iarracht dul i dtreo eile, stopadh, dul ar a ghlúine, rud ar bith ach dul i dtreo an teampaill.
en_us: Again and again, Paul made an attempt to go in another direction, to stop, to go on his knees, anything but going in the direction of the temple.

source: B'fhada ó bhí sé ina pháiste ach .
en_us: It was a long time since he was a child, but .

source: Ba chosúil í le hainmhí beo a bheadh ag síneadh i dtreo a chos.
en_us: It was like a living animal was stretching towards his foot.

source: Ba chrá croí do gach duine é Máirtín agus ní raibh aon dul as sin!
en_us: Martin was a torment to everyone and there was no getting away from it!

source: Ba ghráin leis boladh na háite.
en_us: He had hated the smell of the place.

source: Baineadh an anáil de nuair a chonaic sé na rudaí a bhí mórthimpeall air.
en_us: He drew a breath when he saw the things that were all around him.

source: Baineadh geit as Aodh mar a bheadh splanc leictreachais tar éis é a bhualadh.
en_us: Aodh jumped as though an electrical spark had hit him.

source: Bheadh air a shúile a oscailt, ach ní ligfeadh an eagla dó é sin a dhéanamh.
en_us: He had to open his eyes, but the fear wouldn't let him do that.

source: Bheadh fearg an domhain orm dá gcaillfinn cluiche de chuid Man.
en_us: I would be incredibly angry if I missed a Man. U. game.

source: Bhog Bean Uí Ruiséil ar aghaidh.
en_us: Mrs. O'Russell moved forward.

source: Bhog an dochtúir go dtí bun na leapa agus léigh sé cairt Phóil.
en_us: The doctor moved to the foot of the bed and read Paul's chart.

source: Bhog duine nó beirt den rang go míshuaimhneach.
en_us: One or two people of the class moved restlessly.

source: Bhreathnaigh Pól ar Aodh.
en_us: Paul looked at Aodh.

source: Bhreathnaigh Pól ar an bhfógra geal a bhí ar a T-léine: Is mise Tomás.
en_us: Paul looked at the white sticker that was on his T-shirt: I'm Thomas.

source: Bhreathnaigh Pól ar na scáileanna a bhí cóngarach dá chosa.
en_us: Paul looked at the shadows that were close do his legs.

source: Bhreathnaigh sé ar Phól agus chaoch sé súil air sular chas sé i dtreo a thuismitheoirí a bhí ina suí go ciúin taobh leis an leaba.
en_us: He looked at Paul and winked his eye at him before turning to his parents that were sitting quietly at the side of the bed.

source: Bhreathnaigh sé ar Phól le súile fuara, na súile á leathdhúnadh aige le scrúdú a dhéanamh ar an mbuachaill a bhí os a chomhair.
en_us: He looked at Paul with cold eyes, the eyes being half-closed in order to examine the boy that was in front of him.

source: Bhreathnaigh sé go neirbhíseach taobh thiar de ach ní raibh rian den phluais íseal ann, tada ach ballaí loma ag síneadh uaidh ar an dá thaobh.
en_us: He looked nervously behind him but there was no trace of the low cave, only bare walls stretched from him on the two sides.

source: Bhreathnaigh sé i dtreo cheann eile na pluaise.
en_us: He looked towards the other end of the cave.

source: Bhreathnaigh sé isteach agus chuir an radharc iontas air.
en_us: He looked in and saw an incredible sight.

source: Bhreathnaigh sé sa treo ina raibh Bean Uí Ruiséil agus Tomás ach bhí an bheirt acu róghnóthach ag caint leis an gcuid eile den rang le Máirtín agus a chuid pleidhcíochta a thabhairt faoi deara.
en_us: He looked in the direction of Mrs. O'Russell and Tomas but the two were too busy talking to the rest of the class to notice Margin and his tomfoolery.

source: Bhreathnaigh sí thar a spéaclaí móra ar an mbeirt bhuachaillí óga a bhí fós ag breathnú ar an radharc scanrúil.
en_us: She looked over her large glasses at the two young boys that were still looking at the terrifying sight.

source: Bhris guth Bhean Uí Ruiséil isteach orthu.
en_us: The voice of Mrs. O'Russell broke in on them.

source: Bhrúigh siad ar oscailt iad agus isteach leo trí dhorchlaí na háite.
en_us: They pushed them open and went in through the corridors of the place.

source: Bhuail Aodh buille uirthi lena lámh féin.
en_us: Aodh smacked it with his own hand.

source: Bhuail tuirse mhór Pól, chuimil sé a aghaidh.
en_us: Exhaustion hit Paul, he rubbed his face.

source: Bhuail uafás Pól.
en_us: Panic hit Paul.

source: Bhí Aodh ina sheasamh gan focal as, agus é ag stánadh roimhe.
en_us: Aodh was standing without a word, staring in front of him.

source: Bhí Daithí Fitswalter, an seandálaí clúiteach, tar éis teacht ar iarsmaí cathrach, cathair iontach mór agus í ceilte i bhforaois thiubh ar an leithinis idir deisceart Mheicsiceo agus tuaisceart Ghuatamala.
en_us: Daithí Fitswalter, the famous archaeologist, after finding remains of a city, a large amazing city hidden in a thick forest on the peninsula between the southern part of Mexico and the northern part of Guatemala.

source: Bhí Máirtín ag méiseáil leis an .
en_us: Martin was messing with the .

source: Bhí Pól agus Aodh neirbhíseach agus iad ag siúl idir na dealbha uafara seo.
en_us: Paul and Aodh were nervous while they were going between these terriifying figures.

source: Bhí Pól in ann píosa beag den chraiceann bán ar a mhuineál a fheiceáil.
en_us: Paul was able to see a little bit of the white skin on his neck.

source: Bhí Pól ina sheasamh i bpluais mhór a bhí na céadta méadar ar fhad.
en_us: Paul was standing in a large cave that was hundreds of meters long.

source: Bhí Xatlacan sa chónra chéanna a bhí le beatha shíoraí a chur ar fáil dó.
en_us: Xatlacan was in the same coffin that was supposed to give him eternal live.

source: Bhí a chosa lag tuirseach.
en_us: His legs were weak and tired.

source: Bhí a chosa á iompar níos cóngaraí agus níos cóngaraí don seanteampall.
en_us: His feet were carrying him closer and closer to the old temple.

source: Bhí a chuid éadaigh oíche greamaithe dá dhroim agus taise na foraoise mórthimpeall air ag meascadh leis an allas.
en_us: Some of his night clothes attached in the back while the moisture of the forest around him mixed with the sweat.

source: Bhí a fhios aige, in ainneoin an méid a dúirt sé lena thuismitheoirí, céard a tharla ar maidin san iarsmalann.
en_us: He knew, despite what he said to his parents, what had happened this morning in the museum.

source: Bhí a ghruaig rua le feiceáil ar an bpiliúr bán.
en_us: His red hair could be seen on the white pillow.

source: Bhí a oiread eagla ar an bpobal roimh an draoi seo go raibh faitíos orthu é a mharú.
en_us: The people were so scared of this magician such they feared to kill him.

source: Bhí ainmhithe de chineál éigin ina luí ag cosa na deilbhe, nathair nimhe, iaguar agus éan a raibh cuma fheargach air.
en_us: Animals of all kinds were lying at the foot of the statue, a poisonous snake, a jaguar and an angry-looking bird.

source: Bhí an draoi i bponc agus níorbh fhada go raibh sé teanntaithe acu.
en_us: The magician was in trouble and it wasn't long until they had him cornered.

source: Bhí an mháistreás ina seasamh os comhair na cónra móire de chloch dhorcha a bhí ina luí ar sheastán ard.
en_us: The teacher was sitting in front of a large coffin of dark stone that was lying on a high stand.

source: Bhí an rang ag éisteacht go cúramach le Tomás anois.
en_us: The class was listening carefully to Tomas now.

source: Bhí an tsíleáil íseal, ní raibh sí ach méadar os a chionn.
en_us: The ceiling was low, not more than a meter above his head.

source: Bhí an téip uafásach le cloisteáil gan stad sa chúlra.
en_us: The awful tape could be heard without cease in the background.

source: Bhí bladhmanna beaga ag lasadh na háite ó thinte guail i miasa móra, miasa a bhí snoite as carraigeacha ísle cruinne.
en_us: Small flames were lighting the place from a coal fire on large alters, altars that were cut from low rounded stones.

source: Bhí buachaill óg sa dara ceann síos uaidh, a dhroim le Pól.
en_us: There was a young boy in the second one down from him, his back to Paul.

source: Bhí ceann de sciatháin na cathaoireach á bhualadh go mall ag na hingne fada salacha ar cheann de lámha an draoi: tic tic tic.
en_us: The ends of the arms of the chair were being tapped slowly by the long dirty nails on the ends of the magician's hands: tic tic tic.

source: Bhí corp seanduine ann, é clúdaithe le héadach bán.
en_us: There was an old body there, covered in a white cloth.

source: Bhí craiceann a aghaidhe chomh teann le páipéar i gcaoi is go gceapfá nach raibh sé tar éis a bheith sa chónra ach le cúpla lá.
en_us: The skin of its face was as tight as paper, such that you would think he hadn't been in the coffin but a few days.

source: Bhí cur síos ar an taispeántas sna nuachtáin, ar an raidió agus ar an teilifís, agus labhair go leor staraithe go díograiseach faoi.
en_us: The exhibit was described in the news, on the radio and on the television, and a lot of historians spoke about it.

source: Bhí dea-aoibh ar an rang ar fad agus iad ag caitheamh an lae in Iarsmalann na Cathrach ag breathnú ar an taispeántas mór nua, «Ríocht Rúnda na Manatayach».
en_us: The whole class had a cheerful demeanor as they spent the day in the City Museum looking at the big new exhibit, «The Secret Kingdom of the Manataya».

source: Bhí eagla a chraicinn ar Phól agus fonn air rith as an áit, ach ina ainneoin sin, bhog sé níos cóngaraí don chathaoir mhór.
en_us: Paul was frightened out of his skin and wanted to run from the pace, but despite that, he moved closer to the large chair.

source: Bhí feithidí agus éin choimhthíocha ag eitilt mórthimpeall.
en_us: Exotic insects and birds were flying around.

source: Bhí foirgneamh beag eile ar bharr an teampaill, foirgneamh dronuilleogach.
en_us: There was another small building at the top of the temple, a rectangular building.

source: Bhí fuaim an chaiséid a bhí mar chúlra do radharc na híobartha le cloisteáil sa chiúnas.
en_us: The sound of the cassette was background to the scene of the sacrifice, could be heard in the silence.

source: Bhí fuaim na carraige le cloisteáil, í cóngarach dó, á leanúint.
en_us: Hearing the noise of the rocks, close to him, following him.

source: Bhí iarsmaí d'fhoirgneamh éigin ar an taobh eile den phlásóg.
en_us: Some building ruins were on the other side of the clearing.

source: Bhí masc gránna déanta as ceann cnámharlaigh ar aghaidh an duine a raibh an scian ina lámh.
en_us: An ugly mask made from a skull was on the face of the person that had a knife in his hand.

source: Bhí mé an-tógtha leis an taispeántas féin, gan trácht ar an méid a tharla.
en_us: I was very taken with the exhibit itself, without speaking to what happened.

source: Bhí míshuaimhneas air.
en_us: The air was agitated.

source: Bhí na draoithe agus na hasarlaithe iontach tábhachtach, agus, de ghnáth, ba iad na draoithe a bhíodh ag lorg eolais, tríd an eolaíocht agus an réasúnaíocht, faoin domhan.
en_us: The magicians and the sorcerers were extremely important, and, usually, the druids sought knowledge, through science and reasoning, about the world.

source: Bhí na scáileanna scanrúla fágtha taobh thiar de.
en_us: The frightening shadows were left behind him.

source: Bhí scian fhada ar crochadh orlach os cionn an chailín, a gob fuilteach dírithe i dtreo a croí.
en_us: A long knife hung inches above the girl, its bloody tip pointed directly at her heart.

source: Bhí screadach scréachach agus scréachaíl le cloisteáil sa chúlra.
en_us: Screaming and screeching could be heard in the background.

source: Bhí screadach [scréachach] agus scréachaíl le cloisteáil sa chúlra.
en_us: Screaming and screeching could be heard in the background.

source: Bhí scéin ina haghaidh ach níor tháinig scread ar bith as a béal oscailte.
en_us: Fear was in her face but no scream at all came from her open mouth.

source: Bhí snoíodóireacht aisteach de dhaoine agus de chloigne ainmhithe sa chéad seomra eile.
en_us: A strange carving of people and of animal heads was in the next room.

source: Bhí spreasán de bhuachaill taobh thiar de agus é ag feadaíl go neamhurchóideach, mar dhea.
en_us: A worthles twig of a boy was behind him, whistling innocently, supposedly!

source: Bhí sraitheanna d'fhir agus de mhná ina seasamh i bpluais mhór fhada íseal eile, iad uilig feistithe mar a bhí sé féin.
en_us: There were series of men and women sitting in another large long love cave, all of them dressed as he was.

source: Bhí sé ag iarraidh maireachtáil go brách.
en_us: He wanted to live forever.

source: Bhí sé ar nós tromluí nach bhféadfadh sé dearmad a dhéanamh air.
en_us: It was like a nightmare that he wasn't able to forget.

source: Bhí sé ar tí rud éigin eile a rá nuair a mhothaigh sé buille ar a dhroim.
en_us: He/it was about to say something else when he felt a blow on his back.

source: Bhí sé cosúil le súil ag breathnú air.
en_us: It was like an eye looking at him.

source: Bhí sé de nós acu buachaillí óga a íobairt, mar shampla.
en_us: It was common for them to sacrifice young boys, for example.

source: Bhí sé deas teolaí sa leaba agus thit sé ina chodladh.
en_us: He was nice and comfy in the bed and he fell asleep.

source: Bhí sé deas, ag an am céanna, a fhios a bheith agat go raibh siad buartha fút agus go raibh siad ag tabhairt aire duit.
en_us: It was nice, at the same time, to know that they were worried about you and that they were giving you attention.

source: Bhí sé fós in ann na súile fuara dorcha sin a fheiceáil, súile a stán gan trua air.
en_us: He was still able to see those cold dark eyes, eyes that stared at him without pity.

source: Bhí sé go hiontach a thuismitheoirí a fheiceáil, ach uaireanta .
en_us: It was wonderful to see his parents, but sometimes .

source: Bhí sé in ann doras garbh adhmaid de chineál éigin a fheiceáil sa bhalla os a chomhair.
en_us: He was able a to see rough wood door of some kind in the wall in front of him.

source: Bhí sé traochta.
en_us: He was exhausted.

source: Bhí sé uafásach te.
en_us: He was terribly hot.

source: Bhí tóirsí ollmhóra ag dó ar na ballaí agus bhí scáileanna á gcaitheamh acu ar fud na háite, ar an urlár agus ar an tsíleáil.
en_us: Large torches were burning on the walls and shadows were being thrown all over the place, on the floor and on the ceiling.

source: Bogaigí ar an bpointe!'
en_us: Move right now!

source: Bogfaimid ar aghaidh go dtí príomhrannóg an taispeántais anois.
en_us: We will go forward to the main room of the exhibit now.

source: Bígí ag breathnú ar an teilifís oíche amárach – agus ná leagaigí lámh ar rud ar bith, le bhur dtoil.
en_us: Watch the television tomorrow night - and don't lay your hand on anything, please.

source: Cabidil a ceathair.
en_us: Chapter four.

source: Cabidil a dó.
en_us: Chapter two.

source: Cabidil a trí.
en_us: Chapter three.

source: Caibidil a haon: An taispeántas
en_us: Chapter one: The exhibit

source: Chaithfeadh sé cuimhneamh gur tromluí a bhí ann.
en_us: He had to remember that this was a nightmare.

source: Chas Máirtín chun an chuma a chur ar an scéal gur ag déanamh staidéir ar an taispeántas a bhí sé – cé nach raibh os a chomhair ach gléas múchta tine a bhí crochta ar an mballa!
en_us: Martin to give credence to his story, like he was studying the exhibit - although there wasn't anything in front of him on the wall but a fire extinguisher hanging there.

source: Chas Neans chuig a fear chéile.
en_us: Neans turned to her husband.

source: Chas Pól, fuadach faoina chroí, agus thug ruathar sa treo eile.
en_us: Paul turned, his heart beating fast, and rushed in the other direction.

source: Chas Tomás i dtreo an tsarcófagais.
en_us: Tomas turned towards the sarcophagus.

source: Chas gach aon duine acu le breathnú air nuair a shiúil sé isteach sa phluais agus mhothaigh sé crith fuar eile i lár a dhroma nuair a bhreathnaigh na súile dorcha sin air, súile a bhí gan trua.
en_us: Every single one turned to look at him when he walked into the cave and he felt another cold chill in the middle of his back when the dark eyes looked at him, eyes that were without pity.

source: Chas sé ar a bhonn agus chonaic sé carraig ollmhór sa bhalla crua a bhí níos lú ná orlach óna aghaidh.
en_us: He turned on his base and he saw a large rock in the hard wall that was closer than an inch from his face.

source: Chas sé i dtreo an ranga go tobann, a shúile ar lasadh.
en_us: He turned towards the class suddenly,

source: Chas sé.
en_us: He turned.

source: Chiúnaigh an rang go tobann.
en_us: The class suddenly calmed down.

source: Chlaon an tUasal Ó Gríofa a chloigeann go mall taobh thiar dá bhean chéile.
en_us: Mr. O'Griofa bent his head slowly behind his wife.

source: Chonacthas dó gur ina sheasamh i bplásóg bheag i bhforaois theochreasach a bhí sé.
en_us: It appeared to him that he was standing in a small level area in a tropical forest.

source: Chonaic sé cruthanna na scáileanna ag athrú ina gcrúba fíochmhara dubha, le hingne fada géara orthu, agus iad ag gluaiseacht trasna an urláir ina threo.
en_us: He saw the shapes of the shadows changing in which fierce black claws, with long sharp nails on them, while they moved across the floor in his direction.

source: Chonaic sé pictiúr soiléir de shúile fuara an chorpáin ina aigne .
en_us: He saw a clear picture of the fold eyes of the corpse in his mind.

source: Chonaic sé uisce ag rith ón tsíleáil agus síos na ballaí taobh thiar de na daoine.
en_us: He saw water running from the ceiling and down the walls behind the people.

source: Chonaic sé, ag ceann eile na pluaise, ar chathaoir a bhí déanta as cinn chnámharlaigh, seanduine seargtha .
en_us: He saw, at the other end of the cave, in a chair that was made from a skeleton, an old withered man.

source: Chreid na Manatayaigh gur shásaigh fuil daoine óga a ndéithe feargacha.
en_us: The Manataya believed that young people's blood appeased the anger of the gods.

source: Chroith Pól a chloigeann go mall.
en_us: Paul shook his head slowly.

source: Chroith Pól a chloigeann.
en_us: Paul shook his head.

source: Chuaigh Pól anonn chuige.
en_us: Paul went to the over side.

source: Chuaigh creathán tríd.
en_us: He shuddered.

source: Chuala sé ainmhithe eile ag búiríl áit éigin i measc na gcrann, ainmhithe móra cuid acu, cheap sé.
en_us: He heard other animals bellowing somewhere in the middle of the trees, large animals some of them, he thought.

source: Chuala sé fuaim, cineál d'osna, ag teacht ón taobh eile den scáthlán anois is arís.
en_us: He heard a noise, a kind of sigh, coming from the other side of the curtain, now and again.

source: Chuala tú a raibh le rá ag an dochtúir anois beag, nár chuala?
en_us: You heard what the doctor said just now, didn't you?

source: Chuimil sé a mhéara ar an gcarraig gharbh.
en_us: He rubbed his finger on the rough stone.

source: Chuir an tUas.
en_us: Mr. O'Griofa put

source: Chuir sé a chos nocht ar an gcéad chéim agus mhothaigh sé an charraig gharbh á scríobadh mar a dhéanfadh páirín.
en_us: He put his naked foot on the first step and he felt the rough stone scraping him like sandpaper would do.

source: Chuir sé igcuimhne dó ceann de na teampaill sin a bhí feicthe aige ar chlár teilifíse faoi na hAstacaigh tamall ó shin.
en_us: It put him in mind of the end of that temple that was seen by him on a television program about the Aztec a while ago.

source: Chúlaigh sé nuair a tháinig ceann de na scáileanna cóngarach dó.
en_us: He retreated when one of the shadows came close to him.

source: Cic breá, scór breá!
en_us: Good kick, good score!
